odin_facebook/app/views/users/_unfriend.html.erb

<% if current_user.inverse_friends?(user) %>
	<%= form_for(current_user.inverse_friendships.find_by(user_id: user.id),
		             html: { method: :delete },
		             remote: true) do |f| %>
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 403471874], ["friend_id", 246944990], ["LIMIT", 1]]