odin_facebook/app/controllers/friendships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 246944990], ["LIMIT", 1]]
---
  def create
    @user = User.find(params[:friend_id])

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 403471874], ["friend_id", 246944990], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 246944990], ["LIMIT", 1]]
---
  def destroy
    @user = Friendship.find(params[:id]).friend
    if @user == current_user
      @user = Friendship.find(params[:id]).user